app/controllers/admin/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = current_user.admin? ? Post.all : Post.active.from_user(current_user).all

INSERT INTO "posts" ("title", "summary", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save