app/views/welcome/_post.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 8]]
---
    <div class="pull-right">
      <%= link_to t('welcome.index.learn_more', comments_count: post.comments.count), admin_post_path(post) %>