app/views/admin/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
    <h1><%= t('.comments') %></h1>
    <% @post.comments.each do |comment| %>