app/controllers/comments_controller.rb

INSERT INTO "comments" ("email", "comment", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "teste@comment.com"], ["comment", "isso é um comentário"], ["post_id", 4], ["created_at", "2015-05-22 05:51:45.253846"], ["updated_at", "2015-05-22 05:51:45.253846"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save