app/controllers/posts_controller.rb

  def index
    @posts = current_user.admin? ? Post.all : Post.active.from_user(current_user).all
---
SELECT "posts".* FROM "posts" WHERE "posts"."active" = 't'

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "summary", "content", "user_id", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "summary" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["summary", "iasd hiuashdiu haiush ds ds d"], ["updated_at", "2015-05-21 23:00:14.769263"], ["id", 4]]