app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
UPDATE "users" SET "role_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role_id", 2], ["updated_at", "2015-05-20 01:05:45.415520"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(secure_params)